<?php

// Проверьте, является ли число простым.
// Напишите функцию определяющая является ли число просты
function isPrime(int $a): bool
{
    return true;
}


// Напишите функцию находящее максимум/минимум/сумму в массиве
// в зависимости от входящего параметра $a
// $a = 1 - максимум.
// $a = 2 - минимум.
// $a = все остальное - сумма.
function maxInArray(array $nums, int $a): int
{
    return 0;
}





// Рекурсия
// Написать функцию бинарного поиска в массиве.
function binarySearch(array $nums, int $entry, int $l, int $r): int
{
    return 0;
}